MOCK_USER_ID = {
    "瀚海雪豹": {
        "user_id": "12345",
        "nickname": "瀚海雪豹"
    },
    "紫老头": {
        "user_id": "888888",
        "nickname": "紫老头"
    }
}

MOCK_USER_INFO = {
    "12345": {
        "user_id": "12345",
        "name": "赵梵宇",
        "age": 23,
        "gender": "男",
        "city": "上海",
        "phone": "15225931333",
        "hobby": "游泳",
        "education": "本科",
        "university": "复旦大学",
        "major": "药学",
        "email": "fyzhao24@m.fudan.edu.cn",
        "post_history": [
            {"time": "2024-05-01", "title": "前几周一直在做实验。五一假期到了，正好用来写毕设论文"},
            {"time": "2024-05-03", "title": "好累啊，腰酸背痛"},
            {"time": "2024-05-07", "title": "修修改改一星期，终于搞定初稿了"},
            {"time": "2024-05-12", "title": "开始做答辩PPT，五分钟怎么讲的完啊"},
            {"time": "2024-05-19", "title": "论文还要继续修改，难受"},
            {"time": "2024-06-01", "title": "明天答辩，躺床上睡不着怎么办"},
            {"time": "2024-06-02", "title": "等待答辩，回去一定要好好睡一觉"},
            {"time": "2024-06-02", "title": "答辩结束，终于可以休息了"},
        ],
    },
    "888888": {
        "user_id": "888888",
        "name": "曹瑞珂",
        "age": 23,
        "gender": "男",
        "city": "安徽",
        "phone": "13800000000",
        "hobby": "摄影",
        "education": "本科",
        "university": "安徽大学",
        "major": "计算机科学与技术",
        "email": "cairuike@m.ahnu.edu.cn",
        "post_history": [
            {"time": "2024-09-01", "title": "今天出差，去北医拿数据集硬盘"},
            {"time": "2024-09-03", "title": "北京好冷，早知道带点厚衣服了"},
            {"time": "2024-09-07", "title": "实验暂停，去武汉找女朋友玩咯"},
            {"time": "2024-09-12", "title": "最近跑了一些算法，但准确率卡在80%左右上不去了，再试试GNN+Transformer吧"},
            {"time": "2024-09-19", "title": "师兄说可以开始写论文了"},
        ],
    }
}

MOCK_PJ1_REPORT = """基于图神经网络的跨境贸易支付监测模型的推理结果已经产生。模型在数据集上的表现如下：

在100个节点中，有93个节点被判定为类别0，7个节点被判定为类别2。具体结果如下：

- 类别0：节点1，节点2，节点3，节点4，节点9，节点10，节点11，节点12，节点13，节点14，节点15，节点16，节点17，节点
18，节点19，节点20，节点21，节点22，节点23，节点24，节点25，节点26，节点27，节点28，节点29，节点30，节点31，节点
32，节点33，节点34，节点35，节点36，节点37，节点38，节点39，节点40，节点41，节点42，节点43，节点44，节点45，节点
46，节点47，节点48，节点49，节点50，节点51，节点52，节点53，节点54，节点55，节点56，节点57，节点58，节点59，节点
60，节点61，节点62，节点63，节点65，节点66，节点67，节点68，节点69，节点70，节点71，节点72，节点73，节点74，节点
75，节点76，节点77，节点78，节点79，节点80，节点81，节点82，节点83，节点84，节点85，节点86，节点87，节点88，节点
89，节点90，节点91，节点92，节点93，节点94，节点95，节点96。

- 类别2：节点0，节点5，节点6，节点7，节点8，节点64，节点97，节点98，节点99。

总结，大多数节点（93%）被分类为类别0，而较小的部分（7%）被分类为类别2。这可能反映了在训练集中类别0的样本数量更多
，模型在识别类别0的能力上表现得更好。同时，模型对于类别2的识别也有一定的能力。"""
